In [14]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(101)

In [2]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [15]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [16]:
df

             A         B
G1 1  2.706850  0.628133
   2  0.907969  0.503826
   3  0.651118 -0.319318
G2 1 -0.848077  0.605965
   2 -2.018168  0.740122
   3  0.528813 -0.589001

In [22]:
df.index.names = ['Groups','Num']

In [23]:
df

                   A         B
Groups Num
G1     1    2.706850  0.628133
       2    0.907969  0.503826
       3    0.651118 -0.319318
G2     1   -0.848077  0.605965
       2   -2.018168  0.740122
       3    0.528813 -0.589001

In [24]:
df['B']['G2'][2]

0.7401220570561068

In [27]:
df.loc['G2'].loc[2]['B']

0.7401220570561068

In [31]:
df.xs(2,level='Num')

               A         B
Groups
G1      0.907969  0.503826
G2     -2.018168  0.740122

In [36]:
d = {'A':[1,2,np.nan],'B':[1,np.nan,np.nan],'C':[1,2,3]}

In [38]:
df = pd.DataFrame(d)

In [41]:
df

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [42]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [43]:
df.dropna(thresh=2)

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2

In [44]:
df

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [45]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           1  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [46]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [47]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [49]:
df = pd.DataFrame(data)

In [50]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [52]:
byComp = df.groupby('Company')

In [57]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [59]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [65]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64